## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@wayofthesys-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/wayofthesys-cinema/serviceAccounts/external-dns@wayofthesys-cinema.iam.gserviceaccount.com/keys/e217f9fb100f1cc3907afa3b6ecc945d81371943" -> (known after apply)
!       name               = "projects/wayofthesys-cinema/serviceAccounts/external-dns@wayofthesys-cinema.iam.gserviceaccount.com/keys/e217f9fb100f1cc3907afa3b6ecc945d81371943" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJY01JeEorazBCTTR3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTNOemd3TlRnNU1ESXlNRFEwT1RNek5qTTJNQ0FYRFRJeU1Ea3lNREF3TWpBd00xb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EYzNPREExT0Rrd01qSXdORFE1TXpNMk16WXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ2RzaG1HWGdoaFBOc0xmcnYrWjI4ZXFueWcKRDhRSmRYamg3bDBwTVFtTHRPK0M4d3dnTThmWTZiSkI2ZVhBaWVYOCtUQWpudVBadUNabXhSUEFjQU0yMU9wZApIWWh2dlp2WGdISWxxMTNVMnlUSVZVWnNtVEhpQk1uZ1dzTjlsK0lEVFBDdmUrOXhzd3J5Uk1GQm1iTTh0SWpsCmFwSWhhNzhEMGo4eDMxODdQcjV6WDhHcExQRDNuOTZ1c0ZGVWxNbDNwd3R6K04vMCtvUjNmeVMwSnlXeXBoM0UKVm9LQmEyUEJtU0pHcG1mU09jWmo2UXJUY2JOdUN3MnBlbmYxZnpvbm1OVjNENmdyQncwNUxsdEhaaUhZTm13SgprRTZ1VlFaeTN4RFc5TUpTYVFteHNNWEt5VnZiMGNYbWZOdmRFejhFNHRhTTA5WmVMQjNyd3JSUGRMdWpBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQWJRdE1oR1E4aGtyL0tIWlkvanNVaApWT3V1cXdNWGpOa3d4bXFjRWoxeUdwMm5uQUJwZHkyeHNOTytSQmNVY3B6U0dqelpYZUxPaGVvbWNHa2wwRFJnCmVRSW5XMU12VW1JUmY3a0swYndBUFdXMzF4cGtMRml6cGwvKzY5aFI1UzdBdXYzQzRBV2RnUTNkOEF3RTh3TWUKQ3dMMTRYNytXR1pIMjhQbGNTQ0RITXlzVWh0SzlSUXRxS1hJMjMrNWNLcjc3SHdIcTBjQkgwWlh3NWY5RWVEUwpkOEQ4MEFzUEE5ekhsY2VyWjNoL2prM2h4ZkpNVkl1QStQWjRPSUxIWlhuM2JoUDFXaFBWWFd0cUFzaFRuc3hTCjhzQWpKR1phUkI3cUswTnY1UUE0bmE3RVpGNEpwblZPajBSaW0xYWpMS242ZUEzVWtZeXVlc1JjNUczeE1zRUUKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/wayofthesys-cinema/serviceAccounts/external-dns@wayofthesys-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-20T00:20:03Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "wayofthesys-cinema"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] must be replaced
-/+ resource "google_gke_hub_membership" "membership" {
!       id            = "projects/wayofthesys-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
-       labels        = {} -> null
!       membership_id = "cinema-membership" -> (known after apply) # forces replacement
!       name          = "projects/wayofthesys-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
        # (1 unchanged attribute hidden)

!       endpoint {
!           gke_cluster {
!               resource_link = "//container.googleapis.com/projects/wayofthesys-cinema/locations/us-central1/clusters/cinema" -> (known after apply) # forces replacement
            }
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
!       id                          = "projects/wayofthesys-cinema/locations/us-central1/clusters/cinema/nodePools/core" -> (known after apply)
!       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-460bd46f-grp",
        ] -> (known after apply)
!       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-460bd46f-grp",
        ] -> (known after apply)
!       max_pods_per_node           = 65 -> (known after apply)
        name                        = "core"
+       name_prefix                 = (known after apply)
!       node_count                  = 2 -> (known after apply)
+       operation                   = (known after apply)
!       version                     = "1.24.3-gke.2100" -> (known after apply)
        # (5 unchanged attributes hidden)

!       autoscaling {
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

!       node_config {
!           machine_type      = "n2-highcpu-4" -> "n2-highcpu-16" # forces replacement
+           min_cpu_platform  = (known after apply)
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
!           taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] must be replaced
-/+ resource "null_resource" "additional_components" {
!       id       = "4929773018948867712" -> (known after apply)
!       triggers = {
-           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
-           "arguments"                     = "20da2117d1f42ce983e8b180ec9b17e0"
-           "md5"                           = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "7748220017696392802" -> (known after apply)
!       triggers = {
-           "arguments"             = "20da2117d1f42ce983e8b180ec9b17e0"
-           "create_cmd_body"       = "cinema us-central1 wayofthesys-cinema false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
-           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
-           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
!       id       = "7179189157101203559" -> (known after apply)
!       triggers = {
-           "destroy_cmd_body"       = "cinema us-central1 wayofthesys-cinema false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
-           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> (known after apply) # forces replacement
    }

Plan: 8 to add, 2 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
